{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "bidding_model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 56],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer"
            },
            "name": "input_layer"
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            },
            "name": "dense"
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu",
              "trainable": true,
              "negative_slope": 0.01
            },
            "name": "leaky_re_lu"
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            },
            "name": "dense_1"
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_1",
              "trainable": true,
              "negative_slope": 0.01
            },
            "name": "leaky_re_lu_1"
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "units": 64,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            },
            "name": "dense_2"
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_2",
              "trainable": true,
              "negative_slope": 0.01
            },
            "name": "leaky_re_lu_2"
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "policy",
              "trainable": true,
              "units": 4,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            },
            "name": "policy"
          }
        ]
      }
    },
    "build_config": {"input_shape": null},
    "compile_config": {
      "optimizer": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.001,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      },
      "loss": "categorical_crossentropy"
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "dense/kernel", "shape": [56, 128], "dtype": "float32"},
        {"name": "dense/bias", "shape": [128], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [128, 128], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [128], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [128, 64], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [64], "dtype": "float32"},
        {"name": "policy/kernel", "shape": [64, 4], "dtype": "float32"},
        {"name": "policy/bias", "shape": [4], "dtype": "float32"}
      ]
    }
  ]
}